##-----------------------------R语言使用中期小结---------------------------------##

#1.R语言使用上手比较容易，矩阵运算功能强大
#2.模型方面，最先使用的是线性回归，用R语言自带函数即可完成拟合，但是发现测试误差
#  较大。后改用局部加权线性回归，属于非参数学习，用一个形似高斯函数的权重函数加
#  入原始线性模型,用随机梯度下降求解新损失函数的最优参数。
#3.只用到了“压缩机运行参数”文件，下一步会根据日期将两个csv文件融合，用该模型进行
#  预测。
##-------------------------------------------------------------------------------##




##-----------------------------R语言代码如下-------------------------------------##


##--------------------局部加权线性回归的权值函数,此算法为非参数学习--------------##                                                                      
Weight<-function(xi,x){sum<-0.0  
                       for(n in 1:6){sum<-sum+(xi[n]-x[n])*(xi[n]-x[n])}
                       sum<--sum/0.5
                       sum<-exp(sum)
                       return(sum)}
##-------------------------------------------------------------------------------##

##-----------------------------修改工作目录--------------------------------------##
# setwd("F:\\燃气压缩机能耗预测测")  

##------------------------读取文件到list->到矩阵--------------------------------##
data<-read.csv("F:\\ddd\\压缩机运行参数.csv",sep=",",header=TRUE)  
data<-do.call(cbind,data)#list->matrix

##----------------------去掉日期,机器号和0值数据---------------------------------##
data<-data[,c(1:7)];data<-data[data[,1]>0,]

##---------------------------------归一化----------------------------------------##
data<-scale(data,scale=TRUE,center=FALSE)


##-------------------------前300条训练,300-376测试-------------------------------##
train<-data[c(1:300),];test<-data[c(301:376),]  
trainData<-train[,c(2:7)];trainLabel<-train[,c(1)]  #训练数据与函数值分开
trainData<-t(trainData)
testData<-test[,c(2:7)];testLabel<-test[,c(1)]   #测试集同上
testData<-t(testData)

##-----------------------------初始化模型参数------------------------------------##
alpha=0.03;xita<-matrix(1,nr=1,nc=6);b=2  

##---------------------------------训练模型--------------------------------------##
result<-matrix(0,nr=1,nc=76)  #结果向量
for(index in 1:76)   #遍历测试集,因为是非参数模型,所以对每个测试样本都要进行一次训练
{
  x<-testData[,index]  #取出测试向量
  for(iterate in 1:100)  #迭代100次
  {
    for(i in 1:300)  #遍历训练集
    {
      inner=trainLabel[i]-(xita%*%trainData[,i]+b)  #损失误差
      w<-Weight(trainData[,i],x)  #权重
      for(j in 1:6)  #遍历参数向量
      {
        xita[j]<-xita[j]+alpha*inner*trainData[j,i]*w   #随机梯度下降迭代公式
      }
      b<-b+alpha*inner*w   #偏执项更新
    }
  }
  result[index]<-xita%*%x+b   #结果记录
}
##------------------------------------------------------------------------------##

##----------------------------------统计预测误差--------------------------------##
sumR<-0.0
sumE<-0.0
h<-matrix(0,nr=76,nc=1)
for(i in 1:76)  #遍历测试集
{
  h[i]<-result[i]-testLabel[i]
  sumR<-sumR+abs(h[i])  #每项误差
  sumE<-sumE+abs(testLabel[i])  #正确结果
}
output<-sumR/sumE
hist(h)
output

##---------------------------------实验结果-------------------------------------##
#  预测误差：0.04847297
#  输出预测误差的直方图,可以看出预测误差呈随机分布, 故预测值接近实际分布.
